---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.MacroFailures
source: html/21799287-26c0-25a4-f16d-74b45a2be812.htm
---
# BuiltInFailures.MacroFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.